###################################################################

# Created by write_sdc on Wed Nov 28 15:19:04 2018

###################################################################
set sdc_version 2.0

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
create_clock [get_ports clk]  -period 1000  -waveform {0 500}
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst]
set_input_delay -clock clk  0  [get_ports {data_rx[6][63]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][62]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][61]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][60]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][59]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][58]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][57]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][56]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][55]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][54]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][53]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][52]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][51]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][50]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][49]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][48]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][47]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][46]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][45]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][44]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][43]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][42]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][41]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][40]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][39]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][38]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][37]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][36]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][35]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][34]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][33]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][32]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][31]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][30]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][29]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][28]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][27]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][26]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][25]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][24]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][23]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][22]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][21]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][20]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][19]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][18]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][17]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][16]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][15]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][14]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][13]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][12]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][11]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][10]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][9]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][8]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][7]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][6]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][5]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][4]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][3]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][2]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][1]}]
set_input_delay -clock clk  0  [get_ports {data_rx[6][0]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][63]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][62]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][61]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][60]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][59]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][58]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][57]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][56]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][55]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][54]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][53]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][52]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][51]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][50]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][49]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][48]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][47]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][46]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][45]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][44]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][43]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][42]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][41]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][40]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][39]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][38]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][37]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][36]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][35]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][34]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][33]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][32]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][31]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][30]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][29]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][28]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][27]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][26]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][25]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][24]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][23]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][22]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][21]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][20]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][19]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][18]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][17]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][16]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][15]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][14]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][13]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][12]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][11]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][10]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][9]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][8]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][7]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][6]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][5]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][4]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][3]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][2]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][1]}]
set_input_delay -clock clk  0  [get_ports {data_rx[5][0]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][63]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][62]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][61]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][60]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][59]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][58]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][57]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][56]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][55]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][54]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][53]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][52]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][51]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][50]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][49]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][48]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][47]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][46]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][45]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][44]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][43]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][42]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][41]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][40]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][39]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][38]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][37]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][36]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][35]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][34]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][33]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][32]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][31]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][30]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][29]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][28]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][27]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][26]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][25]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][24]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][23]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][22]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][21]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][20]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][19]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][18]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][17]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][16]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][15]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][14]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][13]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][12]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][11]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][10]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][9]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][8]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][7]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][6]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][5]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][4]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][3]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][2]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][1]}]
set_input_delay -clock clk  0  [get_ports {data_rx[4][0]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][63]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][62]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][61]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][60]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][59]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][58]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][57]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][56]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][55]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][54]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][53]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][52]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][51]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][50]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][49]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][48]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][47]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][46]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][45]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][44]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][43]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][42]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][41]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][40]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][39]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][38]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][37]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][36]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][35]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][34]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][33]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][32]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][31]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][30]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][29]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][28]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][27]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][26]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][25]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][24]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][23]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][22]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][21]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][20]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][19]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][18]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][17]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][16]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][15]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][14]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][13]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][12]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][11]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][10]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][9]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][8]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][7]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][6]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][5]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][4]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][3]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][2]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][1]}]
set_input_delay -clock clk  0  [get_ports {data_rx[3][0]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][63]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][62]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][61]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][60]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][59]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][58]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][57]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][56]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][55]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][54]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][53]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][52]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][51]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][50]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][49]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][48]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][47]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][46]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][45]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][44]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][43]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][42]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][41]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][40]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][39]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][38]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][37]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][36]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][35]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][34]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][33]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][32]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][31]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][30]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][29]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][28]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][27]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][26]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][25]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][24]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][23]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][22]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][21]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][20]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][19]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][18]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][17]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][16]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][15]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][14]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][13]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][12]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][11]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][10]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][9]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][8]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][7]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][6]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][5]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][4]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][3]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][2]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][1]}]
set_input_delay -clock clk  0  [get_ports {data_rx[2][0]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][63]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][62]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][61]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][60]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][59]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][58]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][57]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][56]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][55]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][54]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][53]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][52]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][51]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][50]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][49]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][48]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][47]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][46]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][45]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][44]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][43]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][42]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][41]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][40]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][39]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][38]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][37]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][36]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][35]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][34]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][33]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][32]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][31]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][30]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][29]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][28]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][27]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][26]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][25]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][24]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][23]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][22]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][21]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][20]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][19]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][18]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][17]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][16]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][15]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][14]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][13]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][12]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][11]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][10]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][9]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][8]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][7]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][6]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][5]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][4]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][3]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][2]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][1]}]
set_input_delay -clock clk  0  [get_ports {data_rx[1][0]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][63]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][62]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][61]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][60]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][59]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][58]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][57]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][56]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][55]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][54]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][53]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][52]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][51]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][50]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][49]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][48]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][47]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][46]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][45]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][44]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][43]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][42]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][41]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][40]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][39]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][38]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][37]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][36]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][35]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][34]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][33]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][32]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][31]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][30]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][29]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][28]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][27]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][26]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][25]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][24]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][23]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][22]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][21]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][20]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][19]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][18]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][17]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][16]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][15]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][14]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][13]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][12]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][11]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][10]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][9]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][8]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][7]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][6]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][5]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][4]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][3]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][2]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][1]}]
set_input_delay -clock clk  0  [get_ports {data_rx[0][0]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[12]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[11]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[10]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[9]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[8]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[7]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[6]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[5]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[4]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[3]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[2]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[1]}]
set_input_delay -clock clk  0  [get_ports {vc_write_rx_vec[0]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[12]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[11]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[10]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[9]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[8]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[7]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[6]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[5]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[4]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[3]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[2]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[1]}]
set_input_delay -clock clk  0  [get_ports {incr_rx_vec[0]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][63]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][62]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][61]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][60]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][59]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][58]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][57]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][56]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][55]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][54]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][53]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][52]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][51]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][50]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][49]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][48]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][47]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][46]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][45]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][44]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][43]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][42]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][41]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][40]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][39]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][38]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][37]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][36]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][35]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][34]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][33]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][32]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][31]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][30]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][29]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][28]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][27]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][26]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][25]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][24]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][23]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][22]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][21]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][20]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][19]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][18]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][17]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][16]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][15]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][14]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][13]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][12]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][11]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][10]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][9]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][8]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][7]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][6]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][5]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][4]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][3]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][2]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][1]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[6][0]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][63]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][62]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][61]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][60]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][59]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][58]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][57]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][56]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][55]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][54]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][53]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][52]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][51]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][50]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][49]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][48]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][47]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][46]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][45]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][44]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][43]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][42]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][41]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][40]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][39]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][38]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][37]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][36]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][35]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][34]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][33]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][32]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][31]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][30]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][29]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][28]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][27]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][26]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][25]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][24]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][23]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][22]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][21]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][20]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][19]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][18]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][17]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][16]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][15]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][14]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][13]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][12]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][11]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][10]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][9]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][8]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][7]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][6]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][5]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][4]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][3]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][2]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][1]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[5][0]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][63]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][62]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][61]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][60]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][59]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][58]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][57]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][56]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][55]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][54]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][53]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][52]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][51]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][50]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][49]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][48]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][47]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][46]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][45]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][44]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][43]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][42]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][41]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][40]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][39]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][38]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][37]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][36]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][35]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][34]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][33]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][32]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][31]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][30]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][29]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][28]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][27]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][26]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][25]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][24]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][23]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][22]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][21]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][20]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][19]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][18]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][17]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][16]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][15]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][14]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][13]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][12]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][11]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][10]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][9]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][8]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][7]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][6]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][5]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][4]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][3]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][2]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][1]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[4][0]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][63]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][62]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][61]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][60]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][59]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][58]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][57]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][56]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][55]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][54]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][53]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][52]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][51]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][50]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][49]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][48]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][47]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][46]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][45]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][44]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][43]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][42]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][41]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][40]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][39]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][38]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][37]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][36]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][35]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][34]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][33]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][32]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][31]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][30]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][29]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][28]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][27]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][26]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][25]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][24]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][23]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][22]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][21]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][20]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][19]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][18]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][17]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][16]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][15]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][14]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][13]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][12]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][11]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][10]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][9]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][8]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][7]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][6]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][5]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][4]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][3]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][2]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][1]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[3][0]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][63]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][62]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][61]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][60]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][59]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][58]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][57]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][56]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][55]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][54]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][53]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][52]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][51]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][50]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][49]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][48]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][47]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][46]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][45]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][44]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][43]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][42]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][41]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][40]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][39]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][38]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][37]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][36]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][35]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][34]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][33]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][32]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][31]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][30]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][29]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][28]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][27]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][26]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][25]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][24]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][23]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][22]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][21]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][20]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][19]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][18]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][17]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][16]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][15]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][14]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][13]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][12]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][11]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][10]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][9]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][8]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][7]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][6]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][5]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][4]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][3]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][2]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][1]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[2][0]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][63]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][62]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][61]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][60]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][59]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][58]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][57]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][56]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][55]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][54]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][53]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][52]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][51]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][50]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][49]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][48]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][47]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][46]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][45]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][44]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][43]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][42]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][41]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][40]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][39]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][38]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][37]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][36]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][35]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][34]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][33]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][32]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][31]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][30]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][29]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][28]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][27]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][26]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][25]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][24]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][23]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][22]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][21]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][20]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][19]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][18]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][17]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][16]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][15]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][14]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][13]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][12]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][11]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][10]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][9]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][8]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][7]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][6]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][5]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][4]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][3]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][2]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][1]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[1][0]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][63]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][62]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][61]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][60]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][59]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][58]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][57]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][56]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][55]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][54]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][53]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][52]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][51]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][50]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][49]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][48]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][47]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][46]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][45]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][44]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][43]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][42]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][41]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][40]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][39]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][38]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][37]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][36]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][35]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][34]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][33]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][32]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][31]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][30]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][29]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][28]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][27]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][26]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][25]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][24]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][23]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][22]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][21]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][20]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][19]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][18]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][17]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][16]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][15]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][14]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][13]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][12]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][11]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][10]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][9]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][8]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][7]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][6]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][5]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][4]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][3]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][2]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][1]}]
set_output_delay -clock clk  0  [get_ports {data_tx_pl[0][0]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[12]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[11]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[10]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[9]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[8]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[7]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[6]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[5]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[4]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[3]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[2]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[1]}]
set_output_delay -clock clk  0  [get_ports {vc_write_tx_pl_vec[0]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[12]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[11]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[10]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[9]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[8]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[7]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[6]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[5]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[4]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[3]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[2]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[1]}]
set_output_delay -clock clk  0  [get_ports {incr_tx_pl_vec[0]}]
